import React from 'react';

export default function About() {
  return (
    <div className="page-container">
      <h2>О проекте</h2>
      <p className="catalog-info">
        Это небольшой проект-каталог фильмов, демонстрирующий работу с маршрутизацией, простыми компонентами React и локальными данными. Так же показать навыки работы с React и создание удобного интерфейса для пользователей.
        И систему заказов фильмов с возможностью регистрации и авторизации.
      </p>
    </div>
  );
}
