const movieData = [
    {
        id: 1,
        title: "Остров проклятых",
        director: "Мартин Скорсезе",
        year: 2010,
        description: "Два американских судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных преступников. При проведении расследования им придется столкнуться с паутиной лжи, обрушившимся ураганом и смертельным бунтом обитателей клиники.",
        rating: 8.5,
        poster: "https://www.themoviedb.org/t/p/w1280/bmCM1JA3QH0cOrYq8CCbxH2HQtl.jpg", // ссылку на изображение постера
    },
    {
        id: 2,
        title: "Криминальное чтиво",
        director: "Квентин Тарантино",
        year: 1994,
        description: "Двое бандитов Винсент Вега и Джулс Винфилд ведут философские беседы в перерывах между разборками и решением проблем с должниками криминального босса Марселласа Уоллеса. В первой истории Винсент проводит незабываемый вечер с женой Марселласа Мией. Во второй Марселлас покупает боксёра Бутча Кулиджа, чтобы тот сдал бой. В третьей истории Винсент и Джулс по нелепой случайности попадают в неприятности.",
        rating: 7.9,
        poster: "https://www.themoviedb.org/t/p/w1280/7FaHjGa4RvKJZHzY7c9UgTTH9KN.jpg", // ссылку на изображение постера
    },
    {
        id: 3,
        title: "Крепкий орешек",
        director: "Джон МакТирнан",
        year: 1988,
        description: "В суперсовременном небоскрёбе Лос-Анджелеса полицейский Джон Макклейн ведёт смертельную схватку с людьми некоего Ганса Грубера, под видом политических террористов взявших в заложники два десятка человек, включая и Холли Дженаро, благоверную Джона. Началось всё с того, что парень прилетел в город к жене, оказался на рождественском приёме, а вылилось — в настоящую войну, в которой он одерживает победу лишь неимоверными усилиями.",
        rating: 7.3,
        poster: "https://www.themoviedb.org/t/p/w1280/4Y6ClpOYfQJtrQ6jGxEfq8tqOpi.jpg", // ссылку на изображение постера
    },
    {
        id: 4,
        title: "Побег из Шоушенка",
        director: "Фрэнк Дарабонт",
        year: 1994,
        description: "Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.",
        rating: 8.9,
        poster: "https://www.themoviedb.org/t/p/w1280/yvmKPlTIi0xdcFQIFcQKQJcI63W.jpg", // ссылку на изображение постера
    },
    {
        id: 5,
        title: "Крёстный отец",
        director: "Фрэнсис Форд Коппола",
        year: 1988,
        description: "Криминальная сага, повествующая о нью-йоркской сицилийской мафиозной семье Корлеоне. Фильм охватывает период 1945-1955 годов. Глава семьи, Дон Вито Корлеоне, выдаёт замуж свою дочь. В это время со Второй мировой войны возвращается его любимый сын Майкл. Майкл, герой войны, гордость семьи, не выражает желания заняться жестоким семейным бизнесом. Дон Корлеоне ведёт дела по старым правилам, но наступают иные времена, и появляются люди, желающие изменить сложившиеся порядки. На Дона Корлеоне совершается покушение.",
        rating: 8.6,
        poster: "https://www.themoviedb.org/t/p/w1280/hoowzozsn0XQGtgH8nyivAMZfPN.jpg", // ссылку на изображение постера
    },
    {
        id: 6,
        title: "Зелёная миля",
        director: "Фрэнк Дарабонт",
        year: 1999,
        description: "Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.",
        rating: 8.5,
        poster: "https://www.themoviedb.org/t/p/w1280/lHxe8t4B0CKv4DO0C0B4rsuiG95.jpg", // ссылку на изображение постера
    },
]

export default movieData;